As expected jsonencode() does not fix the AWS error.


### Terragrunt inputs
```
inputs
{
  bucket = "foobar"
  versioning = false
  tags = {
    Environment = "${local.ENVIRONMENT_NAME}"
  }

  # Enable WORM 
  # Ref: https://docs.aws.amazon.com/AmazonS3/latest/userguide/object-lock.html
  object_lock_configuration = jsonencode({
    object_lock_enabled = "Enabled"
    rule = {
      default_retention = {
        mode = "GOVERNANCE", # FIXME: Switch to COMPLIANCE once working
        days = "${local.WORM_RETENTION}" 
      }
    }
  })

  # Enable data lifecycle : automatically delete or decrease tiers 
  lifecycle_rule = jsonencode([ 
    {
      id      = "Delete logs after X days"
      enabled = true
      prefix  = ""
      abort_incomplete_multipart_upload_days = 7
      expiration = {
        days = "${local.RETENTION_DAYS}"
      }
    },
    {
      id      = "Move files to lesser tier after X days"
      enabled = true
      prefix  = ""
      abort_incomplete_multipart_upload_days = 7
      transition = [
        {
          days          = 60 
          storage_class = "STANDARD_IA"
        },
        {
          days          = 180 
          storage_class = "GLACIER"
        },
      ]
    }
  ])
}
```

### Terragrunt module calling the `terraform-aws-s3-bucket` module
```
module "s3_bucket" {
  source = "terraform-aws-modules/s3-bucket/aws"

  create_bucket = var.create_bucket
  tags          = var.tags
  bucket        = var.bucket
  bucket_prefix = var.bucket_prefix
  acl           = var.acl
  attach_policy = var.attach_policy
  policy        = var.policy

  versioning = {                            # if I comment this
    enabled = var.versioning        # then it will create the
  }                                                # object lock

  lifecycle_rule = var.lifecycle_rule

  # S3 bucket-level Public Access Block configuration
  block_public_acls       = var.block_public_acls
  block_public_policy     = var.block_public_policy
  ignore_public_acls      = var.ignore_public_acls
  restrict_public_buckets = var.restrict_public_buckets

  # Encryption by default
  server_side_encryption_configuration = {
    rule = {
      apply_server_side_encryption_by_default = {
        sse_algorithm = "AES256"
      }
    }
  }
  object_lock_configuration = var.object_lock_configuration
}
```
### Terragrunt output
```
$ terragrunt apply
Acquiring state lock. This may take a few moments...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=foobar]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "foobar"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Development"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "Delete logs after X days"

          + expiration {
              + days = 30
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "Move files to lesser tier after X days"

          + transition {
              + days          = 180
              + storage_class = "GLACIER"
            }
          + transition {
              + days          = 60
              + storage_class = "STANDARD_IA"
            }
        }

      + object_lock_configuration {
          + object_lock_enabled = "Enabled"

          + rule {
              + default_retention {
                  + days = 1
                  + mode = "GOVERNANCE"
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_arn  = (known after apply)
  + s3_bucket_name = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.s3_bucket.aws_s3_bucket.this[0]: Creating...
╷
│ Error: Error putting S3 versioning: InvalidBucketState: An Object Lock configuration is present on this bucket, so the versioning state cannot be changed.
│ 	status code: 409, request id: R3TW0HJ2C2FSCSSC, host id: FGrrxywcXQFLgc+Vxg9mKgtiab8TYmK9HiIN3eMWmyYciGLuFBNa92qKeiyqcxTDYcgUWiD/GWo=
│ 
│   with module.s3_bucket.aws_s3_bucket.this[0],
│   on .terraform/modules/s3_bucket/main.tf line 5, in resource "aws_s3_bucket" "this":
│    5: resource "aws_s3_bucket" "this" {
│ 
╵
Releasing state lock. This may take a few moments...
ERRO[0066] Hit multiple errors:
Hit multiple errors:
exit status 1 

```
